---
kind: method
id: M:Autodesk.Revit.DB.FamilyType.HasValue(Autodesk.Revit.DB.FamilyParameter)
source: html/c965f8f4-c440-1e3b-c015-e8fe827e6d46.htm
---
# Autodesk.Revit.DB.FamilyType.HasValue Method

Indicates if this family parameter has an assigned value or not.

## Syntax (C#)
```csharp
public bool HasValue(
	FamilyParameter familyParameter
)
```

## Parameters
- **familyParameter** (`Autodesk.Revit.DB.FamilyParameter`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when the input argument-"familyParameter"-is Nothing nullptr a null reference ( Nothing in Visual Basic) .
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown if the input argument-"familyParameter"-is invalid.